Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/supplicant_core/cy_supplicant_process_et.c
/*
 * Copyright 2024, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 */

#include "cy_enterprise_security_error.h"
#include "cy_enterprise_security_log.h"
#include "cy_supplicant_process_et.h"
#include "cy_supplicant_host.h"
#include "cy_eap.h"
#include "cy_tls_abstraction.h"
#include "whd.h"
#include "whd_events_int.h"
#include "cy_ttls.h"
#include "cyabs_rtos.h"

/******************************************************
 *                    Macros
 ******************************************************/

/* Supplicant library allocates thread stack memory, Recommended to keep this macro enabled */
#define RTOS_USE_STATIC_THREAD_STACK

#define CY_SUPPLICANT_PROCESS_ET_INFO cy_enterprise_security_log_msg
#define CY_SUPPLICANT_PROCESS_ET_BYTES( x ) //printf x

//#define ENABLE_SUPPLICANT_DUMP_BYTES

#ifdef ENABLE_SUPPLICANT_DUMP_BYTES
static void          supplicant_dump_bytes                     ( const uint8_t* bptr, uint32_t len );
#else
#define supplicant_dump_bytes( bptr, len )
#endif


#define IF_TO_WORKSPACE( interface )   ( active_supplicant_workspaces[ WHD_STA_ROLE ] )     /* STA is the only currently supported interface. */

/* Labels */
#define CY_EAP_TTLS_LABEL       "ttls keying material"
#define CY_EAP_TLS_LABEL        "client EAP encryption"
#define CY_EAP_TLS_V13_LABEL    "EXPORTER_EAP_TLS_Key_Material"

/******************************************************
 *              Function Prototypes
 ******************************************************/
extern cy_rslt_t cy_tls_receive_eap_packet( supplicant_workspace_t* supplicant, supplicant_packet_t* packet );

static cy_rslt_t supplicant_send_eap_tls_packet( supplicant_workspace_t* workspace, tls_agent_event_message_t* tls_agent_message, uint32_t timeout );

/******************************************************
 *              Global variables
 ******************************************************/

supplicant_workspace_t* active_supplicant_workspaces[SUPPLICANT_WORKSPACE_ARRAY_SIZE] = { 0 };
const whd_event_num_t supplicant_events[] = { WLC_E_LINK, WLC_E_DEAUTH_IND, WLC_E_DISASSOC_IND, WLC_E_NONE };

/******************************************************
 *              Function Definations
 ******************************************************/

#ifdef ENABLE_SUPPLICANT_DUMP_BYTES
static void supplicant_dump_bytes(const uint8_t* bptr, uint32_t len)
{
    uint32_t i = 0;

    for (i = 0; i < len; )
    {
        if ((i & 0x0f) == 0)
        {
            CY_SUPPLICANT_PROCESS_ET_BYTES( ( "\r\n" ) );
        }
        else if ((i & 0x07) == 0)
        {
            CY_SUPPLICANT_PROCESS_ET_BYTES( (" ") );
        }
        CY_SUPPLICANT_PROCESS_ET_BYTES( ( "%02x ", bptr[i++] ) );
    }
    CY_SUPPLICANT_PROCESS_ET_BYTES( ( "\r\n" ) );
}
#endif /*ENABLE_SUPPLICANT_DUMP_BYTES*/

tls_agent_packet_t* supplicant_receive_eap_tls_packet( void* workspace_in, uint32_t* new_length, uint32_t timeout )
{
    supplicant_workspace_t*     workspace = (supplicant_workspace_t*) workspace_in;
    tls_agent_event_message_t   message;
    supplicant_rtos_workspace_t* tls_agent_host_workspace = (supplicant_rtos_workspace_t*)workspace->tls_agent.tls_agent_host_workspace;
    cy_rslt_t result = cy_rtos_get_queue(&tls_agent_host_workspace->event_queue, &message, timeout, 0 );

    if(result == CY_RTOS_TIMEOUT )
    {
        return NULL;
    }
    if ( result != CY_RSLT_SUCCESS )
    {
        return NULL;
    }
    if ( message.event_type == TLS_AGENT_EVENT_EAPOL_PACKET )
    {
       *new_length = message.length;
    }
    else
    {
        cy_rtos_delay_milliseconds( 10 );
    }

    return message.data.packet;
}

cy_rslt_t supplicant_tls_agent_finish_connect( supplicant_workspace_t* workspace )
{
    uint8_t mppe_keys[128]      = {0};
    uint8_t *key                = NULL;
    uint8_t key_len             = 0;
    cy_rslt_t result            = CY_RSLT_SUCCESS;
    const char *label           = NULL;
    uint8_t eap_tls13_context   = CY_ENTERPRISE_SECURITY_EAP_TYPE_NONE;
    uint8_t *context            = NULL;
    uint16_t context_len        = 0;

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "TLS handshake completed successfully\r\n");

    if (workspace->tls_context->tls_v13)
    {
        eap_tls13_context = workspace->eap_type;
        context = &eap_tls13_context;
        context_len = 1;
        label = CY_EAP_TLS_V13_LABEL;
    }
    else
    {
        if(workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TTLS)
        {
            label = CY_EAP_TTLS_LABEL;
        }
        else
        {
            label = CY_EAP_TLS_LABEL;
        }
    }

    /* Calculate MPPE KEY */
    result = cy_tls_get_mppe_key( workspace->tls_context, label, context, context_len, mppe_keys, SIZEOF_MPPE_KEYS);
    if ( result != CY_RSLT_SUCCESS )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to generate MPPE KEY\r\n");
        return result;
    }

