Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/supplicant_core/cy_supplicant_process_et.c
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "MPPE keys:\r\n");
    supplicant_dump_bytes( mppe_keys, SIZEOF_MPPE_KEYS );

    if ( workspace->auth_type == CY_ENTERPRISE_SECURITY_AUTH_TYPE_WPA2_FBT )
    {
        /* Set the PMK which is the second 32 bytes of the MPPE keys */
        key = mppe_keys + PMK_LEN;
        key_len = PMK_LEN;
    }
#ifdef ENABLE_ENTPS_FEATURE
    else if ( workspace->auth_type == CY_ENTERPRISE_SECURITY_AUTH_TYPE_WPA3_192BIT )
    {
        key = mppe_keys;
        key_len = PMK_LEN_192BIT;
    }
#endif
    else
    {
        /* Set the PMK which is the first 32 bytes of the MPPE keys */
        key = mppe_keys;
        key_len = PMK_LEN;
    }

    result  = supplicant_set_pmk( workspace->interface,key, key_len );
    if ( result != CY_RSLT_SUCCESS )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to write PMK to radio firmware\r\n");
        return result;
    }

    if( workspace->tls_context->resume != 1 )
    {
        if( workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TTLS )
        {
            if(workspace->tls_context->tls_v13)
            {
                /* With TLS1.3, server will send an explicit request for TTLS. We should be sending identity as
                 * response to that request. Wait for that packet from server
                 */
                tls_agent_packet_t* packet        = NULL;
                uint32_t length                   = 0;

                packet = supplicant_receive_eap_tls_packet( workspace, &length, SUPPLICANT_TIMEOUT_PHASE2_START );
                if( packet != NULL )
                {
                    supplicant_host_free_packet(workspace->interface->whd_driver, packet );
                }
            }
            supplicant_init_ttls_phase2_handshake( workspace );
        }
        else
        {
            result = supplicant_send_zero_length_eap_tls_packet( workspace );
        }
    }

    return result;
}

cy_rslt_t supplicant_outgoing_pop( void* workspace, supplicant_event_message_t* message )
{
    supplicant_host_workspace_t* supplicant_host = (supplicant_host_workspace_t*)workspace;
    cy_rslt_t result;

    result = cy_rtos_get_queue( &supplicant_host->outgoing_packet_queue, message, SUPPLICANT_TIMEOUT, 0 );

    if(result != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t supplicant_outgoing_push( void* workspace, supplicant_event_message_t* message )
{
    cy_rslt_t result;
    supplicant_host_workspace_t* supplicant_host = (supplicant_host_workspace_t*)workspace;
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Push outgoing packet to queue\r\n");
    result = cy_rtos_put_queue( &supplicant_host->outgoing_packet_queue, message, SUPPLICANT_NEVER_TIMEOUT, 0 );
    if(result != CY_RSLT_SUCCESS)
    {
        whd_buffer_release( supplicant_host->host_workspace.interface->whd_driver, (whd_buffer_t) message->data.packet, WHD_NETWORK_TX );
        return CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t supplicant_host_get_tls_data( supplicant_workspace_t* workspace,supplicant_packet_t eapol_packet, uint16_t offset, uint8_t** data, uint16_t* fragment_available_data_length, uint16_t *total_available_data_length )
{
    uint16_t packet_length = supplicant_host_get_packet_size(workspace->interface->whd_driver, eapol_packet );

    *data = supplicant_host_get_data( workspace->interface->whd_driver, eapol_packet ) + offset;
    *total_available_data_length    = packet_length - offset;
    *fragment_available_data_length = *total_available_data_length;

    return CY_RSLT_SUCCESS;
}

cy_rslt_t supplicant_fragment_and_queue_eap_response( supplicant_workspace_t *workspace )
{
    supplicant_packet_t          packet;
    eap_tls_packet_t*            header;
    uint32_t                     length_to_be_fragmented;
    uint32_t                     eap_tls_length;
    uint8_t*                     data;
    supplicant_event_message_t   message;
    uint32_t                     packet_length;
    uint32_t                     length_field_overhead = 0;

    length_to_be_fragmented = workspace->data_end - workspace->data_start;
    eap_tls_length          = length_to_be_fragmented;
    data                    = workspace->buffer;
    workspace->have_packet  = 0; /* Buffer should be consumed after this */

    /* This is the start of an EAP fragment chain */
    length_field_overhead = 4;

    while (length_to_be_fragmented != 0)
    {
        uint16_t amount_to_copy = 0;
        cy_rslt_t result;
        uint16_t aligned_length;

        amount_to_copy = (uint16_t) SUPPLICANT_DEFS_MIN(length_to_be_fragmented, ( 1024 - length_field_overhead ) );
        length_to_be_fragmented -= amount_to_copy;
        packet_length  = sizeof(eap_tls_packet_t) - 1 + length_field_overhead + amount_to_copy;
        result = supplicant_host_create_packet( workspace->interface->whd_driver,&packet, packet_length );
        if ( result != CY_RSLT_SUCCESS )
        {
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Unable to create eapol packet\r\n");
            return result;
        }

        header = ( eap_tls_packet_t* ) supplicant_host_get_data(  workspace->interface->whd_driver,packet );
        header->eap.code      = EAP_CODE_RESPONSE;
        header->eap.type      = workspace->eap_type;
        header->eap.id        = workspace->last_received_id;
        header->eap_tls.flags = 0;
        SUPPLICANT_WRITE_16_BE( &aligned_length, (sizeof(eap_header_t) + sizeof(eap_tls_header_t) + length_field_overhead + amount_to_copy) );
        header->eap.length = aligned_length;
        memcpy( &header->data[0] + length_field_overhead, data, amount_to_copy );
        supplicant_host_set_packet_size( workspace->interface->whd_driver,packet, packet_length );

        /* If the length field is included then this is the first (possibly only) fragment */
        if ( length_field_overhead == 4 )
        {
            header->eap_tls.flags = EAP_TLS_FLAG_LENGTH_INCLUDED;
            SUPPLICANT_WRITE_32_BE( &header->data, eap_tls_length );
            if ( length_to_be_fragmented != 0 )
            {
                header->eap_tls.flags |= EAP_TLS_FLAG_MORE_FRAGMENTS;
            }

            result = supplicant_queue_message_packet( workspace, SUPPLICANT_EVENT_PACKET_TO_SEND, packet );
            if ( result != CY_RSLT_SUCCESS )
            {
                CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Sending EAPOL packet failed\r\n");
                return result;
            }
            length_field_overhead = 0;

