Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/supplicant_core/cy_supplicant_process_et.c
        }
        else /* The length field is not included */
        {
            if ( length_to_be_fragmented != 0 )
            {
                header->eap_tls.flags |= EAP_TLS_FLAG_MORE_FRAGMENTS;
            }
            message.event_type  = SUPPLICANT_EVENT_PACKET_TO_SEND;
            message.data.packet = packet;

            result = supplicant_outgoing_push((void*) workspace->supplicant_host_workspace, &message );
            if ( result != CY_RSLT_SUCCESS )
            {
                CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Sending EAPOL fragment failed\r\n");
                return result;
            }
        }

        if ( length_to_be_fragmented != 0 )
        {
            data += amount_to_copy;
        }
    }
    return CY_RSLT_SUCCESS;
}

/* Free a previously create phase2 work space. */
cy_rslt_t supplicant_phase2_deinit( supplicant_workspace_t* workspace )
{
    supplicant_phase2_workspace_t* phase2_workspace = workspace->ptr_phase2;
    whd_result_t res = CY_RSLT_SUCCESS;

    if ( phase2_workspace != NULL )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Terminate PEAP thread\r\n");

        if ( phase2_workspace->thread_stack != NULL )
        {
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "MEM : FREE : Free PEAP thread stack\r\n");
            supplicant_host_free( phase2_workspace->thread_stack );
            phase2_workspace->thread_stack = NULL;
        }

        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "MEM : FREE : Free PEAP workspace\r\n");
        supplicant_host_free( workspace->ptr_phase2 );
        workspace->ptr_phase2 = NULL;
    }

    return res;
}

cy_rslt_t supplicant_phase2_stop( supplicant_workspace_t* workspace )
{
    supplicant_phase2_workspace_t* phase2_workspace = workspace->ptr_phase2;

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Stop supplicant_peap_thread\r\n");
    if ( (phase2_workspace != NULL) && (phase2_workspace->state.result != CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_NOT_STARTED) )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Signal abort to Phase2 thread\r\n");
        phase2_workspace->state.result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ABORTED;
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Wait for PEAP thread to exit\r\n");
        cy_rtos_join_thread( &phase2_workspace->thread );
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "PEAP thread exited\r\n");
    }

    return CY_RSLT_SUCCESS;
}

cy_rslt_t supplicant_init_state(supplicant_workspace_t* workspace, eap_type_t eap_type )
{
    workspace->eap_type                 = eap_type;
    workspace->current_sub_stage        = SUPPLICANT_EAP_START;

    workspace->eap_handshake_start_time = 0;

    return CY_RSLT_SUCCESS;
}

cy_rslt_t supplicant_tls_agent_init( tls_agent_workspace_t* workspace )
{
    supplicant_rtos_workspace_t* host_workspace;

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : MEM : MALLOC : Allocating TLS Agent host workspace\r\n", __FUNCTION__, __LINE__);
    host_workspace = supplicant_host_malloc("tls_agent workspace", sizeof(supplicant_rtos_workspace_t));
    if (host_workspace == NULL)
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, " ERROR : [%s()] : L%d : Failed to allocate workspace for TLS Agent\r\n", __FUNCTION__, __LINE__);
        return CY_RSLT_ENTERPRISE_SECURITY_NOMEM;
    }
    memset(host_workspace, 0, sizeof(supplicant_rtos_workspace_t));
    workspace->tls_agent_host_workspace = host_workspace;

#ifdef RTOS_USE_STATIC_THREAD_STACK
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : MEM : MALLOC : Allocating TLS Agent thread stack\r\n", __FUNCTION__, __LINE__);
    host_workspace->thread_stack = supplicant_host_malloc("tls agent stack", TLS_AGENT_THREAD_STACK_SIZE);
    if (host_workspace->thread_stack == NULL)
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR,
            "ERROR : Failed to allocate thread stack for TLS Agent\r\n");
        supplicant_host_free(host_workspace);
        host_workspace = NULL;
        return CY_RSLT_ENTERPRISE_SECURITY_NOMEM;
    }
    memset( host_workspace->thread_stack, 0, TLS_AGENT_THREAD_STACK_SIZE );
#else
    host_workspace->thread_stack = NULL;
#endif

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, " [%s()] : L%d : Init event queue for TLS Agent\r\n", __FUNCTION__, __LINE__);
    cy_rtos_init_queue( &host_workspace->event_queue,  15 , sizeof(tls_agent_event_message_t)) ;

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, " [%s()] : L%d : TLS Agent init done!\r\n", __FUNCTION__, __LINE__);

    return CY_RSLT_SUCCESS;
}

cy_rslt_t supplicant_tls_agent_deinit( tls_agent_workspace_t* workspace )
{
    supplicant_rtos_workspace_t* host_workspace = workspace->tls_agent_host_workspace;

    if ( host_workspace != NULL )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Waiting for TLS Agent thread to join\r\n", __FUNCTION__, __LINE__);

        cy_rtos_join_thread(&host_workspace->thread);
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : TLS Agent thread joined\r\n", __FUNCTION__, __LINE__);

        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Deinit TLS Agent thread queue\r\n", __FUNCTION__, __LINE__);
        cy_rtos_deinit_queue( &host_workspace->event_queue );

        if ( host_workspace->thread_stack != NULL )
        {
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : MEM : FREE : Freeing TLS Agent thread stack\r\n", __FUNCTION__, __LINE__);
            supplicant_host_free( host_workspace->thread_stack );
            host_workspace->thread_stack = NULL;
        }

        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : MEM : FREE : Freeing TLS Agent host workspace\r\n", __FUNCTION__, __LINE__);
        supplicant_host_free( workspace->tls_agent_host_workspace );
        workspace->tls_agent_host_workspace = NULL;
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, " [%s()] : L%d : TLS Agent de-init done!\r\n", __FUNCTION__, __LINE__);
    }

    return CY_RSLT_SUCCESS;
}

void supplicant_eap_handshake_cleanup( supplicant_workspace_t* workspace )
{
    /* Check if clean up is already done */
    if ( workspace->eap_handshake_start_time == 0 )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Already cleaned up\r\n");
        return;
    }

    /*** Free the resources and reset the states ***/
    if ( workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_PEAP || workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TTLS)
    {
        /* Stop and terminate PEAP thread, since EAP handshake is over */
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Stop PEAP thread\r\n");
        supplicant_phase2_stop( workspace );
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Terminate PEAP thread\r\n");
        supplicant_phase2_deinit( workspace );
    }

    /* Stop and terminate TLS agent thread, since EAP handshake is over */
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "[%s()] : L%d : Deinit Supplicant agent\r\n", __FUNCTION__, __LINE__);
    supplicant_tls_agent_deinit( &workspace->tls_agent );

    /* Clean the session as we no longer need it */
    cy_tls_session_cleanup(workspace->tls_context);

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Reset supplicant states\r\n");
    supplicant_init_state( workspace, workspace->eap_type );

    return;
}

