Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/supplicant_core/cy_supplicant_process_et.c
cy_rslt_t supplicant_tls_calculate_overhead( supplicant_workspace_t* workspace, uint16_t available_space, uint16_t* header, uint16_t* footer )
{
    return cy_tls_calculate_overhead(  workspace, workspace->tls_context, available_space, header, footer );
}

static cy_rslt_t supplicant_send_eap_tls_packet( supplicant_workspace_t* workspace, tls_agent_event_message_t* tls_agent_message, uint32_t timeout )
{
    supplicant_rtos_workspace_t* tls_agent_host_workspace = (supplicant_rtos_workspace_t*) workspace->tls_agent.tls_agent_host_workspace;
    cy_rslt_t result = cy_rtos_put_queue(&tls_agent_host_workspace->event_queue, tls_agent_message, SUPPLICANT_NEVER_TIMEOUT, 0);
    if ( result != CY_RSLT_SUCCESS )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Supplicant unable to push packet to tls agent queue\r\n");
        supplicant_host_free_packet( workspace->interface->whd_driver,tls_agent_message->data.packet );
    }

    return CY_RSLT_SUCCESS;
}

void supplicant_tls_agent_thread( cy_thread_arg_t arg )
{
    supplicant_workspace_t* workspace = (supplicant_workspace_t*)arg;
    supplicant_rtos_workspace_t* host = (supplicant_rtos_workspace_t*)workspace->tls_agent.tls_agent_host_workspace;
    supplicant_event_message_t message;

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\r\nTLS handshake start..\r\n");
    if ( cy_tls_generic_start_tls_with_ciphers( workspace->tls_context, workspace, TLS_VERIFICATION_REQUIRED ) != CY_RSLT_SUCCESS )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "TLS handshake failed with error\r\n");
        workspace->supplicant_result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ABORTED;
    }
    else
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "TLS Agent finish connect start..\r\n");
        if ( supplicant_tls_agent_finish_connect( workspace ) == CY_RSLT_SUCCESS)
        {
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "TLS Agent finish connect completed\r\n");
        }
        else
        {
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "TLS Agent finish connect failed\r\n");
        }
    }
    /* Clean up left over messages in the event queue */
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Cleanup TLS Agent event queue\r\n");
    while ( cy_rtos_get_queue( &host->event_queue, &message, 0, 0 ) == CY_RSLT_SUCCESS )
    {
        if (message.event_type == SUPPLICANT_EVENT_EAPOL_PACKET_RECEIVED || message.event_type == SUPPLICANT_EVENT_PACKET_TO_SEND )
        {
            supplicant_host_free_packet(workspace->interface->whd_driver,message.data.packet);
        }
    }
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Cleanup of TLS Agent event queue done!\r\n");

    cy_rtos_exit_thread();
}

cy_rslt_t supplicant_tls_agent_start( supplicant_workspace_t* workspace )
{
    supplicant_rtos_workspace_t* host_workspace = (supplicant_rtos_workspace_t*) workspace->tls_agent.tls_agent_host_workspace;

    workspace->have_packet = 0;
    return cy_rtos_create_thread(&host_workspace->thread, supplicant_tls_agent_thread, "tls_agent", host_workspace->thread_stack, TLS_AGENT_THREAD_STACK_SIZE, CY_RTOS_PRIORITY_ABOVENORMAL, (cy_thread_arg_t) workspace);
}

cy_rslt_t supplicant_get_result( supplicant_workspace_t* workspace )
{
    return workspace->supplicant_result;
}


void supplicant_set_identity( supplicant_workspace_t* workspace, const uint8_t* eap_identity, uint32_t eap_identity_length )
{
    workspace->outer_eap_identity_length = eap_identity_length;
    memcpy( workspace->outer_eap_identity, eap_identity, SUPPLICANT_DEFS_MIN( eap_identity_length, sizeof(workspace->outer_eap_identity) ) );
}

void supplicant_set_inner_identity( supplicant_workspace_t* workspace, eap_type_t eap_type, void* inner_identity )
{
    eap_type_t inner_eap_type = workspace->inner_eap_type;
    if( eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_PEAP ||
            ( (eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TTLS && (inner_eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_MSCHAPV2 || inner_eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_LEAP) ) ) )
    {
        supplicant_phase2_state_t*        phase2        = (supplicant_phase2_state_t*) workspace->ptr_phase2;
        supplicant_inner_identity_t*      identity = (supplicant_inner_identity_t*) inner_identity;

        if ( phase2 == NULL )
            return;

        phase2->identity_length = SUPPLICANT_DEFS_MIN( identity->identity_length, sizeof(phase2->identity));
        phase2->password_length = SUPPLICANT_DEFS_MIN( identity->password_length, sizeof(phase2->password));
        memcpy( phase2->identity, identity->identity, phase2->identity_length );
        memcpy( phase2->password, identity->password, phase2->password_length );
    }
}

/* This function is called by the WHD thread so do not print from here unless the WHD thread stack size has been increased by 4K to allow for printing. */
void* supplicant_external_event_handler( whd_interface_t ifp, const whd_event_header_t* event_header, const uint8_t* event_data, /*@returned@*/ void* handler_user_data )
{
    supplicant_workspace_t* workspace = (supplicant_workspace_t*) handler_user_data;

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "[%s()] : L%d : Event type = [%u], Status = [%u], Reason = [%u], Flags = [%u]\r\n", __FUNCTION__, __LINE__, (unsigned int)event_header->event_type, (unsigned int)event_header->status,(unsigned int)event_header->reason, (unsigned int)event_header->flags);
    switch ( event_header->event_type )
    {
        case WLC_E_DEAUTH_IND:
        case WLC_E_DISASSOC_IND:
        {
            break;
        }

        case WLC_E_LINK:
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Supplicant received link event\r\n");
            if ( ( event_header->flags & WLC_EVENT_MSG_LINK ) != 0 )
            {
                if ( workspace->current_sub_stage == SUPPLICANT_EAP_START )
                {
                    workspace->current_main_stage = SUPPLICANT_INITIALISING;
                    cy_rtos_get_time( &workspace->start_time );

                    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Start timer to wait for EAPOL ID request\r\n", __FUNCTION__, __LINE__);
                    supplicant_host_start_timer( workspace->supplicant_host_workspace, EAPOL_PACKET_TIMEOUT ); /* Start a timer to wait for EAP ID Request */
                }

