Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/supplicant_core/cy_supplicant_process_et.c
            }
            break;

        default:
            break;
    }

    return handler_user_data;
}

cy_rslt_t supplicant_management_set_event_handler( supplicant_workspace_t* workspace, cy_bool_t enable )
{
    whd_result_t result;
    static uint16_t events = 0xFF;

    if ( enable == CY_TRUE )
    {
        result = whd_wifi_set_event_handler(( whd_interface_t ) workspace->interface,(const uint32_t*)supplicant_events, supplicant_external_event_handler, workspace, &events );

    }
    else
    {
        result = whd_wifi_deregister_event_handler( ( whd_interface_t ) workspace->interface, events );
    }

    if ( result != WHD_SUCCESS )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Error setting supplicant event handler %d\r\n", (unsigned int)result);
    }

    return (cy_rslt_t) result;
}

/* Create a Phase2 workspace to run EAP in it. */
cy_rslt_t supplicant_phase2_init( supplicant_workspace_t* workspace, eap_type_t type )
{
    supplicant_phase2_workspace_t* phase2_workspace;

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Start supplicant_phase2_init\r\n");
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : MEM : MALLOC : Allocating PEAP workspace\r\n", __FUNCTION__, __LINE__);
    phase2_workspace = supplicant_host_malloc( "supplicant phase2 workspace ", sizeof(supplicant_phase2_workspace_t) );
    if ( phase2_workspace == NULL )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Can't allocate memory for peap workspace, out of heap space!\r\n");
        return CY_RSLT_ENTERPRISE_SECURITY_NOMEM;
    }
    memset( phase2_workspace, 0, sizeof(supplicant_phase2_workspace_t) );
    workspace->ptr_phase2 = phase2_workspace;

#ifdef RTOS_USE_STATIC_THREAD_STACK
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : MEM : MALLOC : Allocating Phase2 thread stack\r\n", __FUNCTION__, __LINE__);
    phase2_workspace->thread_stack = supplicant_host_malloc( "supplicant Phase2 stack", SUPPLICANT_THREAD_STACK_SIZE );
    if ( phase2_workspace->thread_stack == NULL )
    {
        supplicant_host_free( workspace->ptr_phase2 );
        workspace->ptr_phase2 = NULL;
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Can't allocate memory for Phase2 thread stack, out of heap space!\r\n");
        return CY_RSLT_ENTERPRISE_SECURITY_NOMEM;
    }
    memset( phase2_workspace->thread_stack, 0, SUPPLICANT_THREAD_STACK_SIZE );
#else
    phase2_workspace->thread_stack = NULL;
#endif

    phase2_workspace->state.eap_type   = type;
    phase2_workspace->state.result     = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_NOT_STARTED;
    phase2_workspace->state.main_stage = SUPPLICANT_INITIALISING;
    phase2_workspace->state.sub_stage  = SUPPLICANT_EAP_START;

    supplicant_set_inner_identity( workspace, workspace->eap_type, &workspace->inner_identity );

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "supplicant_phase2_init done\r\n");

    return CY_RSLT_SUCCESS;
}

cy_rslt_t supplicant_inner_packet_set_data( whd_driver_t whd_driver,supplicant_packet_t* packet, int32_t size )
{
    return (cy_rslt_t) whd_buffer_add_remove_at_front( whd_driver,(whd_buffer_t *) packet, size );
}

void supplicant_phase2_thread( cy_thread_arg_t arg )
{
    supplicant_workspace_t*      workspace      = (supplicant_workspace_t*) arg;
    supplicant_phase2_workspace_t* phase2_workspace = workspace->ptr_phase2;
    cy_rslt_t (* phase2_event_handler ) (supplicant_workspace_t* , supplicant_packet_t) = NULL;

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "\r\nsupplicant_peap_thread started...\r\n");

    if (workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_PEAP)
    {
        phase2_event_handler = supplicant_process_peap_event;
    }
    else if (workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TTLS)
    {
        phase2_event_handler = supplicant_process_ttls_phase2_event;
    }
    else
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "The eap type is not supported\r\n");
        phase2_workspace->state.result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
    }

    /* Wait until TLS is done or phase2 state is aborted */
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Wait for TLS handshake to finish or abort\r\n");
#ifdef COMPONENT_MBEDTLS
    while ( workspace->tls_context->context.state != MBEDTLS_SSL_HANDSHAKE_OVER &&
            phase2_workspace->state.result != CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ABORTED )
#elif defined (COMPONENT_NETXSECURE)
    while ( workspace->tls_context->tls_handshake_successful != true &&
            phase2_workspace->state.result != CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ABORTED )
#endif
    {
        cy_rtos_delay_milliseconds( 10 );
    }


    if ( phase2_workspace->state.result == CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ABORTED )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Phase2 is aborted\r\n");
    }
    else
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "TLS handshake finished. Start PEAP processing loop\r\n");
    }

    while ( phase2_workspace->state.result == CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_IN_PROGRESS )
    {
        cy_rslt_t result;
        supplicant_packet_t packet;
#ifdef COMPONENT_MBEDTLS
        uint8_t data[1024]= {0};
#endif
        supplicant_buffer_t buffer;
        memset(&buffer, 0, sizeof(buffer));
#ifdef COMPONENT_MBEDTLS
        buffer.payload = data;
        packet =(supplicant_packet_t) &buffer;
#endif

        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Waiting to receive EAP packet\r\n");

        result = cy_tls_receive_eap_packet( workspace, &packet );

        if ( result == CY_RSLT_SUCCESS )
        {
            phase2_event_handler( workspace, packet );
            cy_tls_free_eap_packet(packet);
        }
        else
        {
            cy_rtos_delay_milliseconds( 10 );
        }
    }
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "supplicant_phase2_thread end\r\n");

    cy_rtos_exit_thread();
}

cy_rslt_t supplicant_phase2_start( supplicant_workspace_t* workspace )
{
    supplicant_phase2_workspace_t* phase2_workspace = workspace->ptr_phase2;

    /* validating input parameters */
    if(workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TTLS)
    {
        if(workspace->tunnel_auth_type != CY_ENTERPRISE_SECURITY_TUNNEL_TYPE_EAP)
        {
            return CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
        }
        if(!( workspace->inner_eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_LEAP || workspace->inner_eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_MSCHAPV2))
        {
            return CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
        }
    }
    else if(workspace->eap_type != CY_ENTERPRISE_SECURITY_EAP_TYPE_PEAP)
    {
        return CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
    }

    phase2_workspace->state.result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_IN_PROGRESS;
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Start supplicant_phase2_start\r\n");
    return (cy_rslt_t) cy_rtos_create_thread( &phase2_workspace->thread, supplicant_phase2_thread, "phase2", phase2_workspace->thread_stack, SUPPLICANT_THREAD_STACK_SIZE, CY_RTOS_PRIORITY_ABOVENORMAL, (cy_thread_arg_t) workspace );
}

