Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/supplicant_core/cy_supplicant_process_et.c
cy_rslt_t supplicant_process_event(supplicant_workspace_t* workspace, supplicant_event_message_t* message)
{
    eap_packet_t*             packet =  NULL;
    tls_agent_event_message_t tls_agent_message;
    supplicant_event_message_t      outgoing_packet;
    uint16_t len;

    // CY_SUPPLICANT_PROCESS_ET_INFO(( "[%s()] : L%d : BESL Event Type = [%s]\r\n", __FUNCTION__, __LINE__, SUPPLICANT_EVENT_to_string(message->event_type) ));
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "[%s()] : L%d : BESL Event Type = [%d]\r\n", __FUNCTION__, __LINE__, message->event_type );
    /* Process the event */
    switch ( message->event_type )
    {
        case SUPPLICANT_EVENT_ABORT_REQUESTED:
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "[%s()] : L%d : SUPPLICANT_EVENT_ABORT_REQUESTED\r\n", __FUNCTION__, __LINE__);
            workspace->supplicant_result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ABORTED;
            break;

        case SUPPLICANT_EVENT_EAPOL_PACKET_RECEIVED:
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "[%s()] : L%d : SUPPLICANT_EVENT_EAPOL_PACKET_RECEIVED\r\n", __FUNCTION__, __LINE__);
            packet = (eap_packet_t*)whd_buffer_get_current_piece_data_pointer(workspace->interface->whd_driver,message->data.packet);

            /* Check for identity request */
            if ( packet->eap.code == EAP_CODE_REQUEST )
            {
                workspace->last_received_id = packet->eap.id;
                if ( packet->eap.type == CY_ENTERPRISE_SECURITY_EAP_TYPE_IDENTITY )
                {
                    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Trying to cleanup before starting a fresh handshake...\r\n");
                    supplicant_eap_handshake_cleanup( workspace );

                    if (workspace->current_sub_stage == SUPPLICANT_EAP_START )
                    {
                        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "[%s()] : L%d : SUPPLICANT_EAP_START\r\n", __FUNCTION__, __LINE__);
                        supplicant_get_bssid(  workspace->interface,&workspace->authenticator_mac_address );
                    }

                    cy_rtos_get_time( &workspace->eap_handshake_start_time );
                    cy_rtos_get_time( &workspace->start_time  );
                    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Supplicant received EAP ID Request a time = [%lu]\r\n", workspace->eap_handshake_start_time);

                    /* Stop the EAPOL start timer */
                    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Stop wait timer registered for EAPOL ID request\r\n", __FUNCTION__, __LINE__);
                    supplicant_host_stop_timer( workspace->supplicant_host_workspace );
                    workspace->current_sub_stage = SUPPLICANT_EAP_IDENTITY;
                    supplicant_send_eap_response_packet( workspace, CY_ENTERPRISE_SECURITY_EAP_TYPE_IDENTITY, (uint8_t*)&workspace->outer_eap_identity, workspace->outer_eap_identity_length );
                    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Sent EAP ID Response\r\n", __FUNCTION__, __LINE__);
                }
                else if ( ( packet->eap.type != workspace->eap_type ) && ( workspace->current_sub_stage == SUPPLICANT_EAP_IDENTITY ) )
                {
                    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Supplicant received EAP Type %u\r\n", packet->eap.type);
                    workspace->current_sub_stage = SUPPLICANT_EAP_NAK;
                    supplicant_send_eap_response_packet( workspace, CY_ENTERPRISE_SECURITY_EAP_TYPE_NAK, (uint8_t*)&workspace->eap_type, 1 );

                }
                else if ( ( packet->eap.type == workspace->eap_type ) && ( ( workspace->current_sub_stage == SUPPLICANT_EAP_IDENTITY ) || ( workspace->current_sub_stage == SUPPLICANT_EAP_NAK ) ) )
                {
                    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Supplicant received required EAP Type %u\r\n", packet->eap.type);

                    workspace->current_sub_stage = SUPPLICANT_EAP_METHOD;
                    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Supplicant agent init\r\n", __FUNCTION__, __LINE__);
                    if ( supplicant_tls_agent_init( &workspace->tls_agent ) != CY_RSLT_SUCCESS )
                    {

                        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Supplicant TLS agent initialisation failed\r\n");
                    }
                    else
                    {
                        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Supplicant agent start\r\n", __FUNCTION__, __LINE__);
                        if ( supplicant_tls_agent_start( workspace ) != CY_RSLT_SUCCESS )
                        {

                            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Supplicant TLS agent failed to start\r\n");
                        }
                        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "[%s()] : L%d : Supplicant agent start completed\r\n", __FUNCTION__, __LINE__);

                    }
                }
                else if ( ( packet->eap.type == workspace->eap_type ) && ( workspace->current_sub_stage == SUPPLICANT_EAP_METHOD ) )
                {
                    eap_tls_packet_t* eap_tls_packet;
                    int32_t          header_overhead = sizeof( eap_tls_packet_t ) - 1;
                    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Should be a EAPOL packet for TLS/PEAP/Other. workspace->eap_type = [%d]\r\n", __FUNCTION__, __LINE__, workspace->eap_type);
                    if ( ( workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TLS ) || ( workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_PEAP ) || ( workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TTLS ))
                    {
                        eap_tls_packet = (eap_tls_packet_t*)packet;

                        /* Send a zero length EAP Response if there are more fragments to be received */
                        if ( eap_tls_packet->eap_tls.flags & EAP_TLS_FLAG_MORE_FRAGMENTS )
                        {
                            supplicant_send_zero_length_eap_tls_packet( workspace );
                        }
                        workspace->tls_length_overhead = 0;
                        if ( eap_tls_packet->eap_tls.flags & EAP_TLS_FLAG_LENGTH_INCLUDED )
                        {
                            header_overhead += 4;
                            /* This is introduced as a work around for the conflict in handling the length flag of
                             * TLS record headers. Some servers seem to crank if the length is present while others go
                             * wrong when the length is not present ( see wpa_supplicant comments for Windows Server 2008 NPS
                             * (eap_tls_common.c)). As a workaround, WICED will detect what flag type the server is using and
                             * imitate that. This is most pronounced in PEAP.
                             */
                            workspace->tls_length_overhead = 4;
                        }

                        len = supplicant_host_hton16( eap_tls_packet->eap.length );
                        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "EAP packet received with EAP ID = [%u], len = %d \r\n", (unsigned int)eap_tls_packet->eap.id, len);
                        supplicant_dump_bytes((uint8_t*)&eap_tls_packet->eap, SUPPLICANT_READ_16_BE( (uint8_t *)&eap_tls_packet->eap.length ));

                        /* For EAP-TTLS, allowed EAP packet with length 6 to be send to TLS agent. This message is required in case of
                         * TLS1.3, which act as the request for Phase2 start. In EAP-TTLS case, TLS agent will wait for this packet
                         * after the TLS handshake complete to start Phase2.
                         */
                        if ( supplicant_host_hton16( eap_tls_packet->eap.length ) > 6
                                || ( supplicant_host_hton16( eap_tls_packet->eap.length ) == 6
                                        && workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TTLS ) )
                        {
                            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Move the packet start to the start of TLS data\r\n", __FUNCTION__, __LINE__);

                            /* Move the packet data pointer so it points at the start of TLS data */
                            supplicant_host_consume_bytes(workspace->interface->whd_driver,&message->data.packet, header_overhead);

                            /* Push the current packet to the TLS agent */
                            tls_agent_message.event_type  = TLS_AGENT_EVENT_EAPOL_PACKET;
                            tls_agent_message.data.packet = message->data.packet;

