Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/supplicant_core/cy_supplicant_process_et.c
                            if ( len - (header_overhead - sizeof(eapol_packet_header_t)) > 0)
                            {
                                tls_agent_message.length = len - (header_overhead - sizeof(eapol_packet_header_t));
                            }
                            else
                            {
                               tls_agent_message.length = 0;
                            }
                            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Send the TLS packet to TLS Agent\r\n", __FUNCTION__, __LINE__);

                            supplicant_send_eap_tls_packet( workspace, &tls_agent_message, SUPPLICANT_NEVER_TIMEOUT );

                            /* Break so the packet is not freed by this thread */
                            break;
                        }
                        else
                        {
                            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Received a Zero length EAP request\r\n", __FUNCTION__, __LINE__);
                            /* It's a zero length EAP request */
                            cy_rslt_t result = supplicant_outgoing_pop( workspace->supplicant_host_workspace, &outgoing_packet );
                            if ( result == CY_RSLT_SUCCESS )
                            {
                                CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Calling supplicant_send_eap_tls_fragment()\r\n", __FUNCTION__, __LINE__);
                                supplicant_send_eap_tls_fragment( workspace, outgoing_packet.data.packet );
                            }
                            else
                            {
                                CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Problem with outgoing packet dequeue %u    \r\n", (unsigned int)result);
                            }
                        }
                    }
                }
            }
            /* Check for EAP fail */
            else if ( ( packet->eap.code == EAP_CODE_FAILURE ) || ( packet->eap.code == EAP_CODE_SUCCESS ) )
            {
                CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Received EAP %s!\r\n", ( packet->eap.code == EAP_CODE_SUCCESS ) ? "Success" : "Failed");
                workspace->supplicant_result = ( packet->eap.code == EAP_CODE_SUCCESS ) ? CY_RSLT_SUCCESS : CY_RSLT_ENTERPRISE_SECURITY_EAP_ERROR;

                CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Free the resources and reset the state\r\n");
                supplicant_eap_handshake_cleanup( workspace );

                workspace->current_main_stage = SUPPLICANT_INITIALISED;
            }
            supplicant_host_free_packet(workspace->interface->whd_driver, message->data.packet );

            break;

        case SUPPLICANT_EVENT_TIMER_TIMEOUT:
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Supplicant event timer timeout\r\n");
            if ( ( workspace->current_main_stage == SUPPLICANT_INITIALISING ) && ( workspace->current_sub_stage == SUPPLICANT_EAP_START ) )
            {
                supplicant_get_bssid( workspace->interface, &workspace->authenticator_mac_address );
                CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "BSSID is: %02X:%02X:%02X:%02X:%02X:%02X\r\n", workspace->authenticator_mac_address.octet[0],
                        workspace->authenticator_mac_address.octet[1],
                        workspace->authenticator_mac_address.octet[2],
                        workspace->authenticator_mac_address.octet[3],
                        workspace->authenticator_mac_address.octet[4],
                        workspace->authenticator_mac_address.octet[5]);
                if ( !NULL_MAC( workspace->authenticator_mac_address.octet ))
                {
                    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : Send EAPOL Start request\r\n", __FUNCTION__, __LINE__);
                    supplicant_send_eapol_start( workspace );
                }
            }
            break;

        case SUPPLICANT_EVENT_PACKET_TO_SEND:
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Supplicant event packet to send\r\n");
            supplicant_send_eap_tls_fragment( workspace, message->data.packet );

            if ( workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_PEAP  &&
#ifdef COMPONENT_MBEDTLS
                    ( workspace->tls_context->context.state  >= MBEDTLS_SSL_CLIENT_FINISHED )
#elif defined (COMPONENT_NETXSECURE)
                    ( workspace->tls_context->context.nx_secure_tls_client_state == NX_SECURE_TLS_CLIENT_STATE_SERVERHELLO_DONE  ||
                      workspace->tls_context->context.nx_secure_tls_client_state == NX_SECURE_TLS_CLIENT_STATE_HANDSHAKE_FINISHED )
#endif
            )
            {
                CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Initialize PEAP thread. workspace->tunnel_auth_type %d\r\n", workspace->tunnel_auth_type);
                supplicant_phase2_init(workspace, CY_ENTERPRISE_SECURITY_EAP_TYPE_MSCHAPV2); //workspace->tunnel_auth_type );

                CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Start PEAP thread.\r\n");
                if (supplicant_phase2_start(workspace) != CY_RSLT_SUCCESS)
                {
                    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Supplicant PEAP failed to start\r\n");
                }
            }
            break;

        default:
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "[%s()] : L%d : CY_SUPPLICANT_UNPROCESSED\r\n", __FUNCTION__, __LINE__);
            return CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_UNPROCESSED;
            break;
    }

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "\r\n[%s()] : L%d : Returning successfully from %s\r\n", __FUNCTION__, __LINE__, __FUNCTION__);

    return CY_RSLT_SUCCESS;
}

void supplicant_thread_main( cy_thread_arg_t arg )
{
    cy_time_t                    current_time;
    cy_rslt_t                    result;
    supplicant_event_message_t   message;
    supplicant_workspace_t*      workspace = (supplicant_workspace_t*)arg;
    supplicant_rtos_workspace_t* host = &((supplicant_host_workspace_t*)workspace->supplicant_host_workspace)->host_workspace;

    workspace->supplicant_result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_IN_PROGRESS;

    /* Now that our queue is initialized we can flag the workspace as active */
    IF_TO_WORKSPACE( workspace->interface->role ) = workspace;

