Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/supplicant_core/cy_supplicant_process_et.c
    cy_rtos_get_time( &workspace->start_time );

    while ( workspace->supplicant_result != CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ABORTED )
    {
        uint32_t time_to_wait;

        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "[%s()] : L%d : In processing loop...\r\n", __FUNCTION__, __LINE__);

        cy_rtos_get_time ( &workspace->eap_handshake_current_time );

        if ( ( workspace->eap_handshake_start_time != 0 ) && ( ( workspace->eap_handshake_current_time - workspace->eap_handshake_start_time ) >= EAP_HANDSHAKE_TIMEOUT_IN_MSEC ) )
        {
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "EAP Handshake timed out...\r\n");
            supplicant_eap_handshake_cleanup( workspace );
        }

        /* Update EAP timeout values based on EAP handshake state */
        if ( workspace->current_main_stage != SUPPLICANT_INITIALISED )
        {
            cy_rtos_get_time( &current_time );

            if (( current_time - workspace->start_time ) >= SUPPLICANT_HANDSHAKE_ATTEMPT_TIMEOUT )
            {
                CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Total handshake timeout expired. Quit processing\r\n");
                workspace->supplicant_result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ABORTED;
                continue;
            }

            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Calculate the wait time\r\n");
            time_to_wait = ( SUPPLICANT_HANDSHAKE_ATTEMPT_TIMEOUT ) - ( current_time - workspace->start_time );
            if ( host->timer_timeout != 0 )
            {
                CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Timer timeout is enabled. Find the min wait time again\r\n");
                time_to_wait = SUPPLICANT_DEFS_MIN( time_to_wait, host->timer_timeout - (current_time - host->timer_reference));
            }
        }
        else
        {
            time_to_wait = EAPOL_PACKET_TIMEOUT;
        }

        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Waiting for EAPOL packet\r\n");
        if ( cy_rtos_get_queue( &host->event_queue, &message, time_to_wait, 0 ) != CY_RSLT_SUCCESS )
        {
            /* Create a timeout message to process */
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "\r\nEAPOL packet wait timed out\r\n");
            message.event_type = SUPPLICANT_EVENT_TIMER_TIMEOUT;
            message.data.value = 0;
        }

        /* Process the message */
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "\r\nProcess EAPOL packet\r\n");

        result = supplicant_process_event( workspace, &message );
        if ( result != CY_RSLT_SUCCESS )
        {
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Supplicant error %u\r\n", (unsigned int)result);
        }
    }

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Terminate TLS agent and PEAP threads, if running\r\n");
    supplicant_eap_handshake_cleanup( workspace );
}

void supplicant_thread( cy_thread_arg_t arg )
{
    supplicant_thread_main( arg );

    cy_rtos_exit_thread();
}
/* This function is called by the WHD thread so do not print from here unless the WHD thread stack size has been increased by 4K to allow for printing. */
void supplicant_eapol_packet_handler( whd_interface_t interface, whd_buffer_t buffer )
{
    supplicant_workspace_t* workspace;

    if ( interface->role == WHD_STA_ROLE )
    {
        workspace = IF_TO_WORKSPACE( interface->role );

        if ( workspace == NULL )
        {
            whd_buffer_release( interface->whd_driver,buffer, WHD_NETWORK_RX );
        }
        else
        {
            supplicant_queue_message_packet( workspace, SUPPLICANT_EVENT_EAPOL_PACKET_RECEIVED, buffer );
        }
    }
    else
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "EAPOL packet arriving on incorrect interface %u\r\n", (unsigned int) interface);
    }
}
cy_rslt_t supplicant_init(supplicant_workspace_t* workspace, supplicant_connection_info_t *conn_info)
{
    supplicant_host_workspace_t* supplicant_host_workspace = NULL;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_rslt_t cy_result = CY_RSLT_SUCCESS;
    /* validating ttls input parameters */
    if(conn_info->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TTLS)
    {
        if(conn_info->tunnel_auth_type != CY_ENTERPRISE_SECURITY_TUNNEL_TYPE_EAP)
        {
            return CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
        }
        if(!( conn_info->inner_eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_LEAP || conn_info->inner_eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_MSCHAPV2))
        {
            return CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
        }
    }

    /* key/cert is mandatory for EAP-TLS */
    if ( conn_info->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TLS
            && ( conn_info->private_key == NULL || conn_info->user_cert == NULL ))
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid Key/Certificate for EAP-TLS\r\n");
        return CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
    }

    if ( conn_info->private_key && conn_info->user_cert )
    {
        cy_result = cy_tls_init_identity( conn_info->tls_identity, (char*) conn_info->private_key, conn_info->key_length, conn_info->user_cert, conn_info->user_cert_length );
    }
    else
    {
        cy_result = cy_tls_init_identity( conn_info->tls_identity, NULL, 0, NULL, 0 );
    }

    if ( cy_result != CY_RSLT_SUCCESS )
    {
        return CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
    }

    workspace->tls_context = conn_info->context;
    cy_result = cy_tls_init_root_ca_certificates( workspace->tls_context,(char*) conn_info->trusted_ca_certificates, conn_info->root_ca_cert_length );
    if ( cy_result != CY_RSLT_SUCCESS )
    {
        result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
        goto EXIT_FROM_TLS_INIT_CONTEXT;
    }

    cy_result = cy_tls_init_context( conn_info->context, conn_info->tls_identity, NULL );
    if ( cy_result != CY_RSLT_SUCCESS )
    {
        result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
        goto EXIT_FROM_TLS_INIT_IDENTITY;
    }

    /* Register the EAPOL packet receive handler */
    result = (cy_rslt_t) suppliant_emac_register_eapol_packet_handler( supplicant_eapol_packet_handler );
    if ( result != CY_RSLT_SUCCESS )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "ERROR : EAPOL hndlr registration failed with error = [%d]\r\n", result);
        goto EXIT_FROM_TLS_INIT_ROOT_CA;
    }

    /* Allocate memory for the supplicant host workspace */
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "[%s()] : L%d : MEM : MALLOC : Allocating supplicant host workspace\r\n", __FUNCTION__, __LINE__);
    supplicant_host_workspace = supplicant_host_calloc( "supplicant host", 1, sizeof(supplicant_host_workspace_t) );
    if ( supplicant_host_workspace == NULL )
    {
        result = CY_RSLT_ENTERPRISE_SECURITY_NOMEM;
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "ERROR : Couldn't allocate supplicant host workspace\r\n");
        goto EXIT_FROM_EAPOL_RECV_HANDLER_REGISTRATION;
    }
    workspace->supplicant_host_workspace = supplicant_host_workspace;

    /* Allocate memory for the EAP defragmentation buffer */
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "[%s()] : L%d : MEM : MALLOC : Allocating supplicant defragmentation buffer\r\n", __FUNCTION__, __LINE__);
    workspace->buffer = supplicant_host_calloc( "supplicant buffer", 1, SUPPLICANT_BUFFER_SIZE  );
    if ( workspace->buffer == NULL )
    {
        result = CY_RSLT_ENTERPRISE_SECURITY_NOMEM;
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "ERROR : Couldn't allocate EAPOL packet defragmentation buffer\r\n");
        goto EXIT_FROM_FREEING_SUPPLICANT_HOST_WORKSPACE;
    }
    workspace->buffer_size = SUPPLICANT_BUFFER_SIZE;
    workspace->auth_type = conn_info->auth_type;

    /* Allocate memory for the supplicant host thread stack */
#ifdef RTOS_USE_STATIC_THREAD_STACK
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "[%s()] : L%d : MEM : MALLOC : Allocating supplicant thread stack\r\n", __FUNCTION__, __LINE__);
    supplicant_host_workspace->host_workspace.thread_stack = supplicant_host_calloc("supplicant thread stack", 1, SUPPLICANT_THREAD_STACK_SIZE);
    if (supplicant_host_workspace->host_workspace.thread_stack == NULL)
    {
        result = CY_RSLT_ENTERPRISE_SECURITY_NOMEM;
        goto EXIT_FROM_FREEING_SUPPLICANT_EAP_DEFRAG_BUFFER;
    }
#else
    supplicant_host_workspace->host_workspace.thread_stack = NULL;
#endif

    supplicant_host_workspace->host_workspace.interface = conn_info->interface;
    workspace->interface = conn_info->interface;
    whd_wifi_get_mac_address( (whd_interface_t) workspace->interface ,(whd_mac_t*) &workspace->supplicant_mac_address );

