Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/enterprise-security/source/supplicant_core/cy_supplicant_process_et.c
    supplicant_init_state( workspace, conn_info->eap_type );
    workspace->current_main_stage = SUPPLICANT_INITIALISING;
    workspace->supplicant_result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_NOT_STARTED;

    if(workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TTLS)
    {
        workspace->inner_eap_type = conn_info->inner_eap_type;
        workspace->tunnel_auth_type = conn_info->tunnel_auth_type;
    }
    else if (workspace->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_PEAP)
    {
        workspace->inner_eap_type = conn_info->inner_eap_type;
        workspace->tunnel_auth_type = conn_info->tunnel_auth_type;
    }

    cy_result = cy_rtos_init_queue( &supplicant_host_workspace->host_workspace.event_queue, 15, sizeof(supplicant_event_message_t) );
    if ( cy_result != CY_RSLT_SUCCESS )
    {
        result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
        goto EXIT_FROM_FREEING_SUPPLICANT_EAP_DEFRAG_BUFFER;
    }

    cy_result = cy_rtos_init_queue( &supplicant_host_workspace->outgoing_packet_queue, 10, sizeof(supplicant_event_message_t) );
    if ( cy_result != CY_RSLT_SUCCESS )
    {
        result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
        goto EXIT_FROM_DEINIT_HOST_WORKSPACE_EVENT_QUEUE;
    }
    supplicant_enable_tls( workspace, conn_info->context );
    supplicant_set_identity( workspace, conn_info->eap_identity, strlen( (char*) conn_info->eap_identity ) );

    if ( conn_info->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_PEAP || conn_info->eap_type == CY_ENTERPRISE_SECURITY_EAP_TYPE_TTLS )
    {
        /* Preserve user name and password for PEAP and EAP-TTLS*/
        /* Convert the password from ASCII to UTF16 */
        int i;
        uint8_t* password = (uint8_t*) conn_info->password;
        uint8_t* unicode = (uint8_t*) workspace->inner_identity.password;

        int tem_len = strlen( (char*) conn_info->password );

        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Initialize inner identity and password\r\n");

        for ( i = 0; i <= tem_len; i++ )
        {
            *unicode++ = *password++;
            *unicode++ = '\0';
        }
        workspace->inner_identity.password_length = 2 * ( i - 1 );

        workspace->inner_identity.identity_length = SUPPLICANT_DEFS_MIN( sizeof( workspace->inner_identity.identity ), strlen( (char* )conn_info->user_name ) );
        memcpy( workspace->inner_identity.identity, conn_info->user_name, workspace->inner_identity.identity_length );
    }

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "set supplicant event handlers\r\n");
    if ( supplicant_management_set_event_handler( workspace, CY_TRUE ) != CY_RSLT_SUCCESS )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Supplicant unable to set management event handler.\r\n");
        goto EXIT_FROM_DEINIT_HOST_WORKSPACE_OUTGOING_PACKET_QUEUE;
    }
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "set supplicant event handlers end\r\n");

    return CY_RSLT_SUCCESS;

EXIT_FROM_DEINIT_HOST_WORKSPACE_OUTGOING_PACKET_QUEUE:
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Deinitializing host workspace outgoing packet queue\r\n");
    cy_rtos_deinit_queue( &supplicant_host_workspace->outgoing_packet_queue );

EXIT_FROM_DEINIT_HOST_WORKSPACE_EVENT_QUEUE:
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Deinitializing host workspace event queue\r\n");
    cy_rtos_deinit_queue( &supplicant_host_workspace->host_workspace.event_queue );

EXIT_FROM_FREEING_SUPPLICANT_EAP_DEFRAG_BUFFER:
#ifdef RTOS_USE_STATIC_THREAD_STACK
    if ( supplicant_host_workspace->host_workspace.thread_stack != NULL )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Freeing thread stack\r\n");
        supplicant_host_free( supplicant_host_workspace->host_workspace.thread_stack );
        supplicant_host_workspace->host_workspace.thread_stack = NULL;
    }
#endif /*RTOS_USE_STATIC_THREAD_STACK*/
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Freeing eap defragmentation buffer\r\n");
    supplicant_host_free( workspace->buffer );
    workspace->buffer = NULL;

EXIT_FROM_FREEING_SUPPLICANT_HOST_WORKSPACE:
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Freeing supplicant host workspace\r\n");
    supplicant_host_free( workspace->supplicant_host_workspace );
    workspace->supplicant_host_workspace = NULL;

EXIT_FROM_EAPOL_RECV_HANDLER_REGISTRATION:
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Deregister Eapol receive handler\r\n");
    cy_ent_sec_unregister_eapol_packet_handler( );

EXIT_FROM_TLS_INIT_ROOT_CA:
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Deinitialize TLS ROOT CA\r\n");
    cy_tls_deinit_root_ca_certificates(workspace->tls_context );

EXIT_FROM_TLS_INIT_CONTEXT:
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Deinitialize TLS context\r\n");
    cy_tls_deinit_context( conn_info->context );

EXIT_FROM_TLS_INIT_IDENTITY:
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Deinitialize TLS identity\r\n");
    cy_tls_deinit_identity( conn_info->tls_identity );

return result;
}

cy_rslt_t supplicant_deinit( supplicant_workspace_t* workspace )
{
    supplicant_host_workspace_t* supplicant_host_workspace = (supplicant_host_workspace_t*) workspace->supplicant_host_workspace;
    supplicant_event_message_t message;

    /* Check if supplicant is started before de-initializing it */
    if ( workspace->supplicant_result == CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_NOT_STARTED )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "supplicant is not started\r\n");
        return CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_ERROR;
    }

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Unregister EAPOL handler\r\n");
    cy_ent_sec_unregister_eapol_packet_handler( );

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Reset supplicant event handlers\r\n");
    if ( supplicant_management_set_event_handler( workspace, CY_FALSE ) != CY_RSLT_SUCCESS )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_ERR, "Supplicant unable to set management event handler.\r\n");
    }

    if(supplicant_host_workspace == NULL)
    {
        return CY_RSLT_SUCCESS;
    }

    /* Wait for supplicant thread to exit */
    cy_rtos_join_thread(&supplicant_host_workspace->host_workspace.thread);
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Delete supplicant thread %p \r\n",supplicant_host_workspace->host_workspace.thread);

    /** Queues clean up **/
    /* Clean up left over messages in the event and outgoing packet queues */
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Cleanup supplicant event queue\r\n");
    while ( cy_rtos_get_queue( &supplicant_host_workspace->host_workspace.event_queue, &message, SUPPLICANT_NO_WAIT, 0 ) == CY_RSLT_SUCCESS )
    {
        if ( message.event_type == SUPPLICANT_EVENT_EAPOL_PACKET_RECEIVED || message.event_type == SUPPLICANT_EVENT_PACKET_TO_SEND )
        {
            supplicant_host_free_packet(workspace->interface->whd_driver, message.data.packet );
        }
    }
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Cleanup supplicant outgoing packet queue\r\n");
    while ( cy_rtos_get_queue( &( (supplicant_host_workspace_t*) workspace->supplicant_host_workspace )->outgoing_packet_queue, &message, SUPPLICANT_NO_WAIT, 0 ) == CY_RSLT_SUCCESS )
    {
        if ( message.event_type == SUPPLICANT_EVENT_PACKET_TO_SEND )
        {
            supplicant_host_free_packet(workspace->interface->whd_driver, message.data.packet );
        }
    }

    if ( supplicant_host_workspace != NULL )
    {
        IF_TO_WORKSPACE( supplicant_host_workspace->host_workspace.interface->role ) = NULL;

        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Deinit and free host queues\r\n");
        cy_rtos_deinit_queue( &supplicant_host_workspace->host_workspace.event_queue );
        cy_rtos_deinit_queue( &supplicant_host_workspace->outgoing_packet_queue );
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Deinited and free host queues\r\n");

        if ( supplicant_host_workspace->host_workspace.thread_stack != NULL )
        {
            CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "MEM : FREE : Free supplicant thread stack\r\n");
            supplicant_host_free( supplicant_host_workspace->host_workspace.thread_stack );
            supplicant_host_workspace->host_workspace.thread_stack = NULL;
        }

        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "MEM : FREE : Free supplicant host workspace\r\n");
        supplicant_host_free( supplicant_host_workspace );
        workspace->supplicant_host_workspace = NULL;
    }
    workspace->supplicant_result = CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_NOT_STARTED;

    if ( workspace->buffer != NULL )
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "MEM : FREE : Free supplicant defragmentation buffer\r\n");
        supplicant_host_free( workspace->buffer );
        workspace->buffer = NULL;
    }

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Deinitialize TLS context, cert and identity\r\n");
    cy_tls_deinit_root_ca_certificates(workspace->tls_context);
    cy_tls_deinit_identity( workspace->tls_context->identity );
    cy_tls_deinit_context( workspace->tls_context );

    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Exit success!\r\n");

    return CY_RSLT_SUCCESS;
}

cy_rslt_t supplicant_stop( supplicant_workspace_t* workspace )
{
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Supplicant result = [%d]\r\n", workspace->supplicant_result);
    if (workspace->supplicant_result != CY_RSLT_ENTERPRISE_SECURITY_SUPPLICANT_NOT_STARTED)
    {
        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Signal supplicant thread to exit\r\n");
        supplicant_queue_message_packet(workspace,SUPPLICANT_EVENT_ABORT_REQUESTED, NULL);

        CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Wait for supplicant thread to exit\r\n\r\n");
        cy_rtos_delay_milliseconds(10);
    }
    CY_SUPPLICANT_PROCESS_ET_INFO(CYLF_MIDDLEWARE, CY_LOG_INFO, "Supplicant stopped.\r\n\r\n");
    return CY_RSLT_SUCCESS;
}

cy_rslt_t supplicant_enable_tls( supplicant_workspace_t* supplicant, void* context )
{
    supplicant->tls_context = context;
    return CY_RSLT_SUCCESS;
}

cy_rslt_t supplicant_start( supplicant_workspace_t* workspace )
{
    supplicant_rtos_workspace_t* host_workspace = &((supplicant_host_workspace_t*) workspace->supplicant_host_workspace)->host_workspace;
    return cy_rtos_create_thread(&host_workspace->thread, supplicant_thread, "supplicant", host_workspace->thread_stack, SUPPLICANT_THREAD_STACK_SIZE, CY_RTOS_PRIORITY_ABOVENORMAL, (cy_thread_arg_t)workspace);
}

void supplicant_free_tls_session( cy_tls_session_t* session )
{
    /* If session is not NULL, free it from memory. */
    if(session != NULL)
    {
#ifdef COMPONENT_MBEDTLS
        mbedtls_ssl_session_free(session);
#endif
    }
}
